// В этом разделе основные переменные
const PLATFORM_TYPE = 'vk'
const build = 65;
var SHOULD_LOAD_PROGRESS = true
var MAKE_SCREEN_ON_X = false
var HIDE_VERSION = false;

var DEFAULT_LANG = 'ru'
var yandex_metrika = true
var YM_NUMBER = 89668945

var ANIMATION = true;
var SHOW_STRIKE_BLOCK = true

const UPDATE_BTN_SELECTOR = '';
const UPDATE_MOBILE_BTN_SELECTOR = '';

const AD_DELAY = 20*1000
const AD_INTERVAL = 2*60*1000

// vk
const VK_APP_ID = 8226570;

// sber
const SBER_APP_NAME = 'Угадай 99 фильмов'
const SBER_APP_TOKEN = 'eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiJmZjAwMThiNWZhMGIzNzczNTYwM2ZiZDcyMjliNDY2MDNmNTEwMzI0YzQ0ODlkZjIwNWM1YTczMDM5NTk2Yzk5NDdhYTYiLCJhdWQiOiJWUFMiLCJleHAiOjE2NDg4OTY5NTgsImlhdCI6MTY0ODgxMDU0OCwiaXNzIjoiS0VZTUFTVEVSIiwidHlwZSI6IkJlYXJlciIsImp0aSI6IjRkNTA1ZTBkLWZlZjQtNGQyZS04MTEyLWYwNThlNDU1NWY4MiIsInNpZCI6IjllNTBmYzQ3LWY4MDAtNDg0ZC05YzVjLTUyMzJlMDY3ZGMxOSJ9.IyMSsjNAQJoJ7eZPT90vA6IU7ff8hZUwbO4gvXZCtFgyMil0QxlUPjqy9eA4aexvC4_jLMek2GMUA44dUfYTYKxhTXbhSHddrvqqyRi6jUhkdSdmvtpv9TXhIyuRM9KTPa9UQPveMVxYbzi9dHZKy8aEWfsSwmH_YL2THzBQzVUj7d8EbZ-FZqWaVOm8gN3M-jY6G4jSmASO3m4tPYKIig5uy6f2S6rJWNO2GIb4_CsyXM_GzEOmDOYf7jfcl9n0ygYMWQ-GhvWE-EbLpJi7Vb3DnyTv_QvKBxEndrPcxyGROoV31suI01qsm9VUIAehEn3dHnoums0A2NiJn6CQq2xzul6peZakbhaE_BmX4f1Tm7g5TlYcfU_ghtlhTF9Tt8FjlT2D2yNRUNHcL75eFLAEiM9hsf4MVtmEUp3reaXaxB5F-xl6Ar2jFriKRLtEGSOJQs1VlWLv4Ss9DtkrjLB8WkcGzAIYRM9AIVlFvanowJYMGLxg2Llgk6tIH_XfPUnOC1XIQttEKWgQE61yDLzyyhBsrG17PhR-pCNqzUsnqrHwiwJnUDMxgV5e-Kqk4AAEBo4X8xSI0N0L9BOcgooYrbVL0W1Q9dIW02rM5X642fzp9HuRy3nc2G9bzIT4eLD40TV0c1GUDrGZKU6pHqxmOjgoDOkNwjmZUBdXMTg';
const SBER_testing = false

// gamemonetize
const GM_APP_ID = 'mbhvcbunhuru6t4h7b37sgtfehf1vl77'

// gamedistribution
const GD_APP_ID = "05ff9c8b10a447739074c8c676a3193b"
const GD_AD_DEBUG = true;

var CAMERA_ZOOM = 1.5;

// условные единицы
var sqrs_in_h = 12

// кол-во фильмов
var FILMS_AMOUNT = 145

// задержка после ответа
var NEXT_QUESTION_DELAY = 200*ANIMATION

var DELAY_BEFORE_FLASHING = 600*ANIMATION;
var FLASH_DELAY_1 = 1000*ANIMATION;
var FLASH_DELAY_2 = 50*ANIMATION;

// после какого вопроса просят отзыв
var REVIEW_QUESTION_NUM = 8;

var JOIN_GROUP_NUM = 16;

// 
var WINNER_STREAK = 99

var MARK_RIGHT_ANS = true

var tv_moves = {
	"game": {
		1: {
			"ArrowLeft": 2,
			"ArrowRight": 2,
			"ArrowUp": 3,
			"ArrowDown": 3
		},
		2: {
			"ArrowLeft": 1,
			"ArrowRight": 1,
			"ArrowUp": 4,
			"ArrowDown": 4
		},
		3: {
			"ArrowLeft": 4,
			"ArrowRight": 4,
			"ArrowUp": 1,
			"ArrowDown": 1
		},
		4: {
			"ArrowLeft": 3,
			"ArrowRight": 3,
			"ArrowUp": 2,
			"ArrowDown": 2
		},
	}
}

// пропорции блоков
const proportions = {
	"gv_top_block": {
		"h": 96/825
	},
	"gv_tb_left_block": {
		"prop": 245/96
	},
	"gv_tb_right_block": {
		"prop": 501/235
	},
	"gv_left_block": {
		"prop": 80/1011
	},
	"gv_title_block": {
		"prop": 480/40,
		"h": 0.065
	},
	"gv_frame_block": {
		"prop": 635/360,
		"h": 340/750
	},
	"gv_fb_pic": {
		"prop": 600/400
	},
	"gv_buttons_block": {
		"prop": 620/170,
		"h": 175/750
	},
	"gv_bb_button": {
		"prop": 439/104,
		"h": 80/825
	},
	"mobile_gv_top_block": {
		"h": 80/850
	},
	"mobile_gv_tb_left_block": {
		"prop": 150/80
	},
	"mobile_gv_tb_right_block": {
		"prop": 501/235
	},
	"mobile_gv_title_block": {
		"prop": 320/28,
		"w": 320/410
	},
	"mobile_gv_frame_block": {
		"prop": 494/437,
		"w": 320/410
	},
	"mobile_gv_buttons_block": {
		"prop": 295/330,
		"w": 290/410,
		'h': 330/850
	},
	"gv_strike_block": {
		"prop": 895/458
	},
	"gv_game_over_block": {
		"prop": 770/510
	},
	"gv_gob_pic_result": {
		"prop": 310/80
	},
	"mobile_gv_game_over_block": {
		"prop": 740/720
	}
}



// В этом разделе локализация на другие языки разных разделов игры
var text = {
	'title': {
		"ru": "Угайдай 99 фильмов",
		"en": "Guess 99 films"
	},
	"gv_tb_left_block_span": {
		"ru": "из",
		"en": "in"
	},
	"gv_gob_pic_result_1": {
		"ru": "Угадано фильмов: ",
		"en": "Guessed films: "
	},
	"gv_gob_pic_result_2": {
		"ru": "Ранг: ",
		"en": "Rang: "
	},
	"gv_gob_button_1_text": {
		"ru": "Заново",
		"en": "Restart"
	},
	"gv_gob_button_2_text": {
		"ru": "Получить ❤️ за рекламу",
		"en": "Get ❤️ by video ad"
	},
	"gv_winner_button_1_text": {
		"ru": "Скоро выйдет новая викторина!",
		"en": "Harry Potter"
	},
	"gv_winner_button_2_text": {
		"ru": "Начать заново",
		"en": "Restart"
	},
	"gv_get_review_button_1_text": {
		"ru": "Оценить",
		"en": "Rate"
	},
	"gv_get_review_button_2_text": {
		"ru": "Оценить позже...",
		"en": "Rate later..."
	}
}

// ранги
var rangs = {
	'0': {
		"ru": "Киану Ривз"
	},
	"1": {
		"ru": "Леонардо ДиКаприо",
	},
	"3": {
		"ru": "Роберт Дауни мл."
	},
	"5": {
		"ru": "Уилл Смит"
	},
	"10": {
		"ru": "Стивен Спилберг",
	},
	"15": {
		"ru": "Том Круз",
	},
	"20": {
		"ru": "Анджелина Джоли"
	},
	"30": {
		"ru": "Брэд Питт"
	},
	"50": {
		"ru": "Шерлок Холмс"
	},
	"99": {
		"ru": "Голливуд"
	}
}

var films = {
	"1": 
	{
		"ru": "Мир Юрского периода"
	},
	"2": {
		"ru": "Прометей"
	},
	"3": {
		"ru": "Начало"
	},
	"4": {
		"ru": "Аквамен"
	},
	"5": {
		"ru": "Фантастические твари и где они обитают"
	},
	"6": {
		"ru": "Фантастические твари: Преступления Гриндевальда"
	},
	"7": {
		"ru": "Доктор Стрэндж"
	},
	"8": {
		"ru": "Я, робот"
	},
	"9": {
		"ru": "Игра Эндера"
	},
	"10": {
		"ru": "Восхождение Юпитер"
	},
	"11": {
		"ru": "Матрица: Перезагрузка"
	},
	"12": {
		"ru": "Пятый элемент"
	},
	"13": {
		"ru": "Интерстеллар"
	},
	"14": {
		"ru": "Марсианин"
	},
	"15": {
		"ru": "Валериан и город тысячи планет"
	},
	"16": {
		"ru": "Аннигиляция"
	},
	"17": {
		"ru": "Хоббит: Нежданное путешествие"
	},
	"18": {
		"ru": "Шерлок Холмс"
	},
	"19": {
		"ru": "Шерлок Холмс: Игра теней"
	},
	"20": {
		"ru": "Гарри Поттер и узник Азкабана"
	},
	"21": {
		"ru": "Гарии Поттер и Дары Смерти: часть 1"
	},
	"22": {
		"ru": "Трон: Наследие"
	},
	"23": {
		"ru": "Звездные войны: Месть Ситхов"
	},
	"24": {
		"ru": "Стартрек: Возмездие"
	},
	"25": {
		"ru": "Джон Картер"
	},
	"26": {
		"ru": "Троя"
	},
	"27": {
		"ru": "Исход: Цари и боги"
	},
	"28": {
		"ru": "Послезавтра"
	},
	"29": {
		"ru": "2012"
	},
	"30": {
		"ru": "Люди в черном 3"
	},
	"31": {
		"ru": "Аватар"
	},
	"32": {
		"ru": "Голодные игры: Сойка-пересмешница. Часть I"
	},
	"33": {
		"ru": "Время"
	},
	"34": {
		"ru": "Миссия невыполнима: Протокол Фантом"
	},
	"35": {
		"ru": "007: Координаты «Скайфолл»"
	},
	"36": {
		"ru": "Однажды в Голливуде"
	},
	"37": {
		"ru": "Эквилибриум"
	},
	"38": {
		"ru": "Особое мнение"
	},
	"39": {
		"ru": "Люди Икс: Первый класс"
	},
	"40": {
		"ru": "Люди Икс: Дни минувшего будущего"
	},
	"41": {
		"ru": "Агенты А.Н.К.Л."
	},
	"42": {
		"ru": "Дюна"
	},
	"43": {
		"ru": "Мстители: Финал"
	},
	"44": {
		"ru": "Мумия"
	},
	"45": {
		"ru": "Терминатор 2: Судный день"
	},
	"46": {
		"ru": "Великий Гэтсби"
	},
	"47": {
		"ru": "Искусственный разум"
	},
	"48": {
		"ru": "Космическая Одиссея 2001"
	},
	"49": {
		"ru": "Ван Хельсинг"
	},
	"50": {
		"ru": "Тор"
	},
	"51": {
		"ru": "Тор 2: Царство тьмы"
	},
	"52": {
		"ru": "Хеллбой II: Золотая армия"
	},
	"53": {
		"ru": "Ученик чародея"
	},
	"54": {
		"ru": "Дом странных детей Мисс Перегрин"
	},
	"55": {
		"ru": "Алиса в стране чудес"
	},
	"56": {
		"ru": "Алиса в Зазеркалье"
	},
	"57": {
		"ru": "Чарли и шоколадная фабрика"
	},
	"58": {
		"ru": "Хозяин морей"
	},
	"59": {
		"ru": "Спиди гонщик"
	},
	"60": {
		"ru": "Эверест"
	},
	"61": {
		"ru": "Пираты Карибского моря: На краю света"
	},
	"62": {
		"ru": "Пираты Карибского моря: На странных берегах"
	},
	"63": {
		"ru": "Пираты Карибского моря: Проклятие Чёрной жемчужины"
	},
	"64": {
		"ru": "К звездам"
	},
	"65": {
		"ru": "Пассажиры"
	},
	"66": {
		"ru": "Поезд на Юму"
	},
	"67": {
		"ru": "Мистер и миссис Смит"
	},
	"68": {
		"ru": "Правдивая ложь"
	},
	"69": {
		"ru": "Темная башня"
	},
	"70": {
		"ru": "Война токов"
	},
	"71": {
		"ru": "Игры разума"
	},
	"72": {
		"ru": "Последний самурай"
	},
	"73": {
		"ru": "Герой"
	},
	"74": {
		"ru": "Хроники Риддика"
	},
	"75": {
		"ru": "Великая стена"
	},
	"76": {
		"ru": "Грань будущего"
	},
	"77": {
		"ru": "Первому игроку приготовиться"
	},
	"78": {
		"ru": "Земля будущего"
	},
	"79": {
		"ru": "Хроники хищных городов"
	},
	"80": {
		"ru": "Притяжение"
	},
	"81": {
		"ru": "Вторжение"
	},
	"82": {
		"ru": "Призрак в доспехах"
	},
	"83": {
		"ru": "Боги Египта"
	},
	"84": {
		"ru": "Гладиатор"
	},
	"85": {
		"ru": "Любовь сквозь время"
	},
	"86": {
		"ru": "После нашей эры"
	},
	"87": {
		"ru": "Пекло"
	},
	"88": {
		"ru": "Хэнкок"
	},
	"89": {
		"ru": "Лучше не бывает"
	},
	"90": {
		"ru": "Шоу Трумана"
	},
	"91": {
		"ru": "Обливион"
	},
	"92": {
		"ru": "Война миров"
	},
	"93": {
		"ru": "Война миров Z"
	},
	"94": {
		"ru": "Кредо убийцы"
	},
	"95": {
		"ru": "Хоббит: Пустошь Смауга"
	},
	"96": {
		"ru": "Хоббит: Битва пяти воинств"
	},
	"97": {
		"ru": "Форд против Феррари"
	},
	"98": {
		"ru": "Люди Икс: Апокалипсис"
	},
	"99": {
		"ru": "Я – легенда"
	},
	"100": {
		"ru": "Терминал"
	},
	"101": {
		"ru": "Район №9"
	},
	"102": {
		"ru": "Внутреннее пространство"
	},
	"103": {
		"ru": "Враг мой"
	},
	"104": {
		"ru": "Апполон 13"
	},
	"105": {
		"ru": "Время первых"
	},
	"106": {
		"ru": "Легенда номер 17"
	},
	"107": {
		"ru": "Салют 7"
	},
	"108": {
		"ru": "Изгой один"
	},
	"109": {
		"ru": "Изгой"
	},
	"110": {
		"ru": "Железный человек 3"
	},
	"111": {
		"ru": "Железный человек 2"
	},
	"112": {
		"ru": "Железный человек"
	},
	"113": {
		"ru": "Матрица"
	},
	"114": {
		"ru": "Матрица: Революция"
	},
	"115": {
		"ru": "Звездные войны: Эпизод 2 - Атака клонов"
	},
	"116": {
		"ru": "Темный рыцарь"
	},
	"117": {
		"ru": "Звездные войны: Эпизод 5 - Империя наносит ответный удар"
	},
	"118": {
		"ru": "Мстители"
	},
	"119": {
		"ru": "Звездные войны: Эпизод 4 - Новая надежда"
	},
	"120": {
		"ru": "Властелин колец: Братство кольца"
	},
	"121": {
		"ru": "Черная пантера"
	},
	"122": {
		"ru": "Властелин колец: Две крепости"
	},
	"123": {
		"ru": "Властелин колец: Возвращение Короля"
	},
	"124": {
		"ru": "Вратарь галактики"
	},
	"125": {
		"ru": "Звездные войны: Эпизод 6 - Возвращение Джедая"
	},
	"126": {
		"ru": "Казино Рояль"
	},
	"127": {
		"ru": "Золотой глаз"
	},
	"128": {
		"ru": "Первый мститель"
	},
	"129": {
		"ru": "Первый мститель: Другая война"
	},
	"130": {
		"ru": "Первый мститель: Противостояние"
	},
	"131": {
		"ru": "Майор Гром: Чумной Доктор"
	},
	"132": {
		"ru": "Бен-Гур"
	},
	"133": {
		"ru": "Одинокий рейнджер"
	},
	"134": {
		"ru": "Астерикс на Олимпийских играх"
	},
	"135": {
		"ru": "Мумия возвращается"
	},
	"136": {
		"ru": "День, когда Земля остановилась"
	},
	"137": {
		"ru": "Кома"
	},
	"138": {
		"ru": "Гарри Поттер и Кубок огня"
	},
	"139": {
		"ru": "Дети шпионов 2: Остров несбывшихся надежд"
	},
	"140": {
		"ru": "Тихоокеанский рубеж"
	},
	"141": {
		"ru": "Тихоокеанский рубеж 2"
	},
	"142": {
		"ru": "Кон-Тики"
	},
	"143": {
		"ru": "Европа"
	},
	"144": {
		"ru": "Движение вверх"
	},
	"145": {
		"ru": "Зеленая книга"
	}
}

var groups = {
	"1": [1, 58, 61, 62, 63, 93, 99, 108, 139, 142, 143],
	"2": [23, 24, 48, 64, 65, 2, 9,   13,  14,  15,  22,  42,  57,  76,  81,  87, 102, 103, 104, 105, 117, 124, 82, 119, 140, 141],
	"3": [5,  6,  20, 4,  53, 69,  72,  79,  94,  12,  138 ],
	"4": [7,  43, 50, 51, 52, 110, 111, 112, 39,  40,  98,  116, 118, 121, 128, 129, 130],
	"5": [37, 38, 32, 41, 67, 8,   11,  30,  34,  35,  45,  74,  77,  80,  114],
	"6": [25, 26, 27, 44, 83, 84,  115, 132, 133, 134, 135],
	"7": [17, 21, 55, 56, 95, 96,  31,  73,  75,  120, 122, 123, 10, 85],
	"8": [28, 29, 60, 16, 47, 91,  92,  109, 86,  136, 137],
	"9": [54, 49, 70, 18, 19, 46,  66,  68,  33,  126, 127, 131],
	"10": [71, 78, 89, 90, 97, 100, 106, 3,   36,  88,  107, 113, 125, 101, 59, 144, 145],
	"length": 10
}